In [210]:
import pandas as pd
import numpy as np

### Слияние данных

In [211]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name': ['Pushkin', 'Tolstoy', 'Dostoevsky']}, columns=['author_id', 'author_name'])
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [212]:
books = pd.DataFrame({'author_id': [2, 3, 3, 4], 'book_title': ['War and Peace', 'The Idiot', 'Crime and Punishment', 'Fathers and Sons']})
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

#### Merge

In [213]:
df1 = pd.merge(authors, books, on='author_id', how='inner')
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

#### Left merge

In [214]:
df2 = pd.merge(authors, books, on='author_id', how='left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

#### Right merge

In [215]:
df3 = pd.merge(authors, books, on='author_id', how='right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

#### Outer merge

In [216]:
df4 = pd.merge(authors, books, on='author_id', how='outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

#### Работа с пропущенными данными

In [217]:
df4.loc[df4['book_title'].isnull(), :]

   author_id author_name book_title
0          1     Pushkin        NaN

In [218]:
df4.loc[df4['book_title'].notnull(), :]

   author_id author_name            book_title
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [219]:
df4['book_title'] = df4['book_title'].fillna('unknown')
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [220]:
df4['author_name'].fillna('unknown', inplace=True)
df4

/var/folders/4m/n9xjjgns0d3g3fv4nnp_9zz40000gn/T/ipykernel_81182/141079953.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4['author_name'].fillna('unknown', inplace=True)

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4     unknown      Fathers and Sons

### Добавление столбцов

In [221]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       NaN

In [222]:
df4['quantity'].fillna(0, inplace=True)
df4

/var/folders/4m/n9xjjgns0d3g3fv4nnp_9zz40000gn/T/ipykernel_81182/114969769.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4['quantity'].fillna(0, inplace=True)

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       0.0

In [223]:
df4['quantity'] = df4['quantity'].astype('int')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [224]:
df4.set_index('author_id', inplace=True)
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4             unknown      Fathers and Sons         0

In [225]:
df4.reset_index(inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Удаление данных

In [226]:
df4['price'] = 500
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    500
1          2     Tolstoy         War and Peace         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  Crime and Punishment         1    500
4          4     unknown      Fathers and Sons         0    500

In [227]:
df4 = df4.drop('price', axis=1)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [228]:
df4 = df4.drop(1, axis=0)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Сортировка

In [229]:
df4.loc[1] = [2, 'Tolstoy', 'War and Peace', 1]
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
1          2     Tolstoy         War and Peace         1

In [230]:
df4 = df4.sort_values(by='author_id')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

Переустановление индекса

In [231]:
df4 = df4.reset_index(drop=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Соединение датафреймов

In [232]:
df5 = pd.DataFrame({'author_id': [3, 5], 'author_name': ['Dostoevsky', 'Chekhov'], 'book_title': ['The Gambler', 'Three Sisters'], 'quantity': [2, 3]})
df5

   author_id author_name     book_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5     Chekhov  Three Sisters         3

In [233]:
df6 = pd.concat([df4, df5], axis=0, ignore_index=True)
df6

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
5          3  Dostoevsky           The Gambler         2
6          5     Chekhov         Three Sisters         3

In [234]:
prices= pd.DataFrame({'price': [700, 450, 500, 400, 350]}, index=[1, 2, 3, 5, 6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [235]:
df7 = pd.concat([df6, prices], axis=1)
df7

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    NaN
1          2     Tolstoy         War and Peace         1  700.0
2          3  Dostoevsky             The Idiot         1  450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0
4          4     unknown      Fathers and Sons         0    NaN
5          3  Dostoevsky           The Gambler         2  400.0
6          5     Chekhov         Three Sisters         3  350.0

### Применение функций и методов

In [236]:
df7['total'] = df7['quantity'] * df7['price']
df7

   author_id author_name            book_title  quantity  price   total
0          1     Pushkin               unknown         0    NaN     NaN
1          2     Tolstoy         War and Peace         1  700.0   700.0
2          3  Dostoevsky             The Idiot         1  450.0   450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0   500.0
4          4     unknown      Fathers and Sons         0    NaN     NaN
5          3  Dostoevsky           The Gambler         2  400.0   800.0
6          5     Chekhov         Three Sisters         3  350.0  1050.0

In [237]:
df7['price'].max()

np.float64(700.0)

In [238]:
df7['price'].min()

np.float64(350.0)

In [239]:
df7['price'].mean()

np.float64(480.0)

In [240]:
df7['price'].median()

np.float64(450.0)

In [241]:
df7['price'].std()

np.float64(135.09256086106296)

In [242]:
df7['price'].var()

np.float64(18250.0)

In [243]:
df7.nlargest(3, 'price')

   author_id author_name            book_title  quantity  price  total
1          2     Tolstoy         War and Peace         1  700.0  700.0
3          3  Dostoevsky  Crime and Punishment         1  500.0  500.0
2          3  Dostoevsky             The Idiot         1  450.0  450.0

In [244]:
df7['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

In [245]:
df7['author_name'].nunique()

5

In [246]:
df7['author_name'].value_counts()

author_name
Dostoevsky    3
Pushkin       1
Tolstoy       1
unknown       1
Chekhov       1
Name: count, dtype: int64

Построчное применение функций и методов:

In [247]:
df7['book_title'].apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND PEACE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4        FATHERS AND SONS
5             THE GAMBLER
6           THREE SISTERS
Name: book_title, dtype: object

### Группировка данных

1-й способ

In [248]:
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

2-й способ

In [249]:
price_agg = df7.groupby('author_name').agg({'price': 'max'})
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

In [250]:
price_agg = price_agg.reset_index()
price_agg = price_agg.rename(columns={'price': 'max_price'})
price_agg

  author_name  max_price
0     Chekhov      350.0
1  Dostoevsky      500.0
2     Pushkin        NaN
3     Tolstoy      700.0
4     unknown        NaN